In [1]:
#pivot: The pivot() function reshapes data by turning unique values of one column into new columns.

In [9]:
import pandas as pd

# Sample data
data = {
    'Date': ['2025-01-01', '2025-01-01', '2025-01-02', '2025-01-02'],
    'City': ['Kathmandu', 'Pokhara', 'Kathmandu', 'Pokhara'],
    'Temperature': [12, 18, 14, 20]
}

df = pd.DataFrame(data)
print("Original DataFrame:\n", df)

# Pivot the DataFrame
pivot_df = df.pivot(index='Date', 
                    columns='City', 
                    values='Temperature')
print("\nPivoted DataFrame:\n", pivot_df)

Original DataFrame:
          Date       City  Temperature
0  2025-01-01  Kathmandu           12
1  2025-01-01    Pokhara           18
2  2025-01-02  Kathmandu           14
3  2025-01-02    Pokhara           20

Pivoted DataFrame:
 City        Kathmandu  Pokhara
Date
2025-01-01         12       18
2025-01-02         14       20

Difference Between pivot() and pivot_table()

pivot() → does not allow duplicates (if two rows have the same index/column combination, it will throw an error).

pivot_table() → allows duplicates and lets you apply an aggregation function (mean, sum, etc.).

In [4]:
import pandas as pd

data = {
    'Date': ['2025-01-01', '2025-01-01', '2025-01-01', '2025-01-02'],
    'City': ['Kathmandu', 'Kathmandu', 'Pokhara', 'Pokhara'],
    'Temperature': [12, 15, 18, 20]
}

df = pd.DataFrame(data)
print("Original DataFrame:\n", df)

Original DataFrame:
          Date       City  Temperature
0  2025-01-01  Kathmandu           12
1  2025-01-01  Kathmandu           15
2  2025-01-01    Pokhara           18
3  2025-01-02    Pokhara           20

In [7]:
#df.pivot(index='Date', columns='City', values='Temperature')
# this throws an error because there is 2 row containg same date 2025-01-01 and same city Kathmandu

In [8]:
pivot_tbl = df.pivot_table(
    index='Date', 
    columns='City', 
    values='Temperature', 
    aggfunc='mean'   # You can also use sum, min, max, etc.
)
print(pivot_tbl)
#but pivot table will work bt averaging 12,15->13.5

City        Kathmandu  Pokhara
Date
2025-01-01       13.5     18.0
2025-01-02        NaN     20.0

In [ ]:
import pandas as pd

df = pd.read_csv("../datasets/Salary_Data.csv")
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [11]:
print(df.describe(include='float'))
print()
print(df.describe(include='object'))

               Age  Years of Experience         Salary
count  6702.000000          6701.000000    6699.000000
mean     33.620859             8.094687  115326.964771
std       7.614633             6.059003   52786.183911
min      21.000000             0.000000     350.000000
25%      28.000000             3.000000   70000.000000
50%      32.000000             7.000000  115000.000000
75%      38.000000            12.000000  160000.000000
max      62.000000            34.000000  250000.000000

       Gender    Education Level          Job Title
count    6702               6701               6702
unique      3                  7                193
top      Male  Bachelor's Degree  Software Engineer
freq     3674               2267                518

In [ ]:
df.isnull().sum()   #sum of null values

Age                    2
Gender                 2
Education Level        3
Job Title              2
Years of Experience    3
Salary                 5
dtype: int64

In [6]:
#in a large data droping some data with dropna doesnot affect reslt too much
df_cleaned = df.dropna()
print(f"Remaing rows = {len(df_cleaned)}")

Remaing rows = 6698

In [7]:
print(df_cleaned.isnull().sum())

Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64

In [9]:
print(df_cleaned.dtypes)

Age                    float64
Gender                  object
Education Level         object
Job Title               object
Years of Experience    float64
Salary                 float64
dtype: object

In [17]:
# 1. Finding max value

max_salary = df_cleaned['Salary'].max()
print(max_salary)

250000.0

In [18]:
# 2. Get rows with maximum salary
max_salary_rows = df_cleaned[df_cleaned['Salary']==max_salary]

#3 . Display result
print(max_salary_rows)

       Age Gender    Education Level                 Job Title  \
30    50.0   Male         Bachelor's                       CEO
83    52.0   Male                PhD  Chief Technology Officer
5001  45.0   Male  Bachelor's Degree         Financial Manager

      Years of Experience    Salary
30                   25.0  250000.0
83                   24.0  250000.0
5001                 21.0  250000.0

In [19]:
i = df_cleaned['Salary'] == max_salary
i.head(50)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30     True
31    False
32    False
33    False
34    False
35    False
36    False
37    False
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46    False
47    False
48    False
49    False
Name: Salary, dtype: bool

In [21]:
i = df_cleaned[df_cleaned['Salary'] == max_salary]
i.head(50)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
30,50.0,Male,Bachelor's,CEO,25.0,250000.0
83,52.0,Male,PhD,Chief Technology Officer,24.0,250000.0
5001,45.0,Male,Bachelor's Degree,Financial Manager,21.0,250000.0

In [22]:
job_title_count = df_cleaned['Job Title'].value_counts()
print(job_title_count.head())

Job Title
Software Engineer            518
Data Scientist               453
Software Engineer Manager    376
Data Analyst                 363
Senior Project Engineer      318
Name: count, dtype: int64

In [27]:
most_commom_job_title = df_cleaned['Job Title'].value_counts().idxmax()
count = df_cleaned['Job Title'].value_counts().max()

print(most_commom_job_title)
print(count)

Software Engineer
518